"""
Напишите программу, которая запрашивает у пользователя ввод двух чисел,
затем складывает их и выводит сумму на экран.
"""

a = int(input())
b = int(input())
c = a + b
print('Сумма:', c)
