"""
Напишите программу, которая запрашивает у пользователя ввод длины и ширины прямоугольника,
а затем вычисляет и выводит его площадь.
"""
a = float(input("Введите длину прямоугольника: "))
b = float(input("Введите ширину прямоугольника: "))

c = a * b

print('Площадь прямоугольника равна:', int(c))
