"""
Напишите программу,  которая запрашивает у пользователя его имя
и выводит приветственное сообщение, включающее его имя.
"""

name = input("Введите ваше имя: ")
print("Привет,", name + "!")
